playwright-artillery-head.yml
config:
  target: https://ktb-chat-test.goorm.team/

  phases:
    - duration: 1
      arrivalRate: 8

  engines:
    playwright:
      launchOptions:
        headless: false # FIXME:

  processor: "./stresstest/app.js"

  variables:
    baseUrl: "{{ target }}"

scenarios:
  # - engine: playwright
  #   flowFunction: "loginUser"
  # - engine: playwright
  #   flowFunction: "createNewChat"
  - engine: playwright
    flowFunction: "runAllUserActionsSequentially"